// DEFAULT_PLAYLIST
// 注意：部分歌曲如果是VIP专享，网易云的外链接口会返回403或404，导致无法播放。
// 在 MusicPlayer 中有对加载失败的处理逻辑（遇到错误会自动切歌）。
export const DEFAULT_PLAYLIST = [
  {
    id: 2091770490,
    title: "心を刺す言葉だけ",
    artist: "MIMI / 初音ミク / 可不",
    cover: "https://p1.music.126.net/sqXOIOY78hwZHprUaVrWDg==/109951168990382920.jpg",
    lrc: `[00:00.89]知らないないない
[00:02.29]生き方ひとつ
[00:03.45]耐えらんない夜に涙ふたつ
[00:05.94]笑え ええ ない毎日に
[00:08.46]どうかどうかサヨナラをしたい
[00:10.88]知っちゃったった
[00:12.21]隣の人が
[00:13.42]幸せそうな顔で語るんだ
[00:15.99]空いちゃったった
[00:17.19]心の隙間
[00:18.47]何で 何で誤魔化せばいいの
[00:21.29]正しく生きてきたはずなのに
[00:23.32]今日がどうして寂しいままで
[00:25.83]つらいままで傷だらけになる からさ
[00:28.84]心を刺す言葉だけ聞こえないフリ 上手くなる度に
[00:33.31]夜に輝く 星の煌めきだけは綺麗で
[00:37.17]泣けてくるんだ
[00:38.39]いつかこの記憶すら綺麗に
[00:40.86]過去になれば忘れられるのかな
[00:53.82]ああ 愛想笑いくらい
[00:55.91]心得ていますとも満点の
[00:58.46]ただ ああ 愛してねって思う
[01:00.99]くらい自由にさせておくれ
[01:03.70]今日は信じない
[01:04.79]嗚呼今日も信じない
[01:05.77]幸せの意味も知らないことも
[01:08.70]今日は信じない
[01:09.76]なにもなにも信じない
[01:10.98]それぞれに証明があることも
[01:13.72]どうしたらどうしたら笑えるの
[01:15.89]大人になることが怖くて
[01:18.32]世界の言葉が僕を貫くんだ
[01:21.29]最後は 痛くないように
[01:23.33]どうかその手を離さないでくれ
[01:25.81]聞こえすぎるの
[01:26.90]余計なことが  要らないことが
[01:29.57]僕を汚すの だから
[01:31.38]どうにか隠れて行くの
[01:33.24]それでいいだろ誰も見つけないで
[01:56.21]本当は人並に 生き
[01:58.35]てみたい ってさ 思ってたんだ
[02:00.90]今が過去の 重さと釣り 合う
[02:03.34]ならばそのまま でい られたのかな
[02:05.82]なんでもない 日々の 奥でさ
[02:08.33]日々の 奥でさ夢を見せてよ
[02:10.88]いつか終わるまで願い続ける
[02:13.31]ひとつ存在証明最終便で
[02:16.24]どうして寂しいままで
[02:18.33]つらいままで傷だらけになる からさ
[02:21.38]心を刺す言葉だけ聞こえないフリ上手くなる度に
[02:25.83]夜に輝く 星の煌めきだけは綺麗で
[02:29.61]泣けてくるんだ
[02:30.96]いつかこの記憶すら綺麗に
[02:33.35]過去になれば忘れられるのかな
[02:36.23]ここに居る今はそれだけでもう
[02:38.78]ほかにはなんにも求めないからさ
[02:41.40]1人でそのまま焦らないままで
[02:43.80]人生なぞるの今日だけ
[02:45.83]夜に輝く 星の煌めきだけは綺麗で
[02:49.67]泣けてくるんだ
[02:50.87]いつかこの記憶すら綺麗に
[02:53.30]未来になれば覚えてるのかな`
  },
  {
    id: 3340137252,
    title: "纸飞机",
    artist: "鸣潮先约电台 / 飞行雪绒",
    cover: "https://p1.music.126.net/JP0G2ELXQGfeTvzEsOqeCw==/109951172603135736.jpg",
    lrc: `[00:09.000] 人声修音 : 欧阳嘉豪 (sof.)
[00:30.359]It's magic when snowflakes could cling
[00:36.595]Like powdered stardust on your skin, glistening
[00:43.142]Their moments may be fleet and paper thin
[00:48.785]But through your voyage they will sing
[00:53.272]Soaring like the paper plane we dreamed
[00:59.733]Coasting through the trails we paved
[01:04.112]It’s not make believe
[01:14.465]I will cast a glow up from your sky
[01:18.999]Your ever-guiding light
[01:25.603]Names of greats that make history
[01:31.670]Cave in time to fadeaway memories
[01:36.767]But I won't let it faze me
[01:40.538]Cause I don't pine for what's to be of me
[01:45.611]"Up in the air"
[01:47.074]Isn't "nowhere"
[01:49.650]So there's no floating 'round aimlessly
[01:52.900]Look on up and you'll see
[01:56.319]It grows, and grows, and most of all
[01:59.634]So alive and bursting with
[02:03.153]Colors all blossoming
[02:05.879]What the plan's been promising
[02:08.790]The end's another new beginning ahead
[02:21.029]Did I catch a twinkle in your eye?
[02:27.476]Did they really mirror mine?
[02:31.713]I wanna believe
[02:34.866]It's what keeps my wish afloat
[02:46.880]Soaring like the paper plane we dreamed
[02:53.322]Coasting through the trails we paved
[02:57.607]It's not make believe
[03:08.941]I will cast a glow up from your sky
[03:12.514]Your ever-guiding light
[03:18.204]Ooh`
  },
  {
    id: 2146403327,
    title: "达道，东山",
    artist: "因你而在的梦",
    cover: "https://p1.music.126.net/Lsxwas9NJ4TCnyAcdS01jA==/109951169499871617.jpg",
    lrc: `[00:20.79]苔藓爬满红墙绿瓦枝头飞落的木棉
[00:23.82]问我下课去哪到小卖部的屋檐下
[00:26.79]拍拍膝上泥土我写着阅读赏析
[00:29.16]老板列着记账细目擦亮货架的掌机
[00:31.83]沿街泥红色的砖远处霓虹色泽晚上
[00:34.50]偷摸买到菠萝啤被怂恿起哄喝一罐
[00:37.02]那时想有钱吧买张网游点卡
[00:39.60]漫画的刊数看我专注地享受年华
[00:42.27]柜筒仿写的假条和放学的辣条
[00:45.03]爱逛街的发小和被忘却的恰巧
[00:47.61]我想写的话要过仓颉的大脑
[00:50.37]无须讲解的章节珠江边被打捞
[00:53.01]走过脏乱的街我也走过干净的时间
[00:55.74]步子放慢的夜我被自己关进了时间
[00:58.38]有种反差美是天上日月耀眼与皎洁
[01:01.47]而那耀眼与皎洁照着少年与老街
[01:04.08]我一成不变的旅程不远
[01:09.36]扬起风帆看风吹东山
[01:11.91]我终会重返夙愿
[01:14.43]那已成步点的旅程无言
[01:19.77]看东山口变成了潮人街
[01:22.23]倔强地搭起草房子倔强的曹文轩
[01:24.84]青葱岁月像块橡木板回南天时粘不上
[01:27.69]小时候我尚不敢的长大后我赶不上
[01:30.33]在南方未落下的雪思念开弹窗
[01:33.09]提醒我别再踮脚去够学校矮篮筐
[01:35.67]太繁忙电话不停我抓不紧的旧包裹
[01:38.34]装满誓言答不应也打不赢却都靠我
[01:41.01]思来想去不大妥我的回忆不怕我
[01:43.74]雨夜中我踩着遍地被打湿的无花果
[01:46.35]可我想怀念的街道变成网红的素材
[01:48.99]多年相逢的住宅蒙上相同的雾霭
[01:51.66]看眼前的老屋心里长出钢筋大楼
[01:54.39]我锁在钢筋大楼里头伤心发愁
[01:57.24]如果朋友走散能暂停像久旱逢甘霖
[01:59.73]那雨滴的错是笔和墨的手段更煽情
[02:02.40]不停前进着我前进着做一位炼金者
[02:05.01]把有些新的变旧了有些旧的变心了
[02:07.83]我一成不变的旅程不远
[02:13.32]扬起风帆看风吹东山
[02:15.93]我终会重返夙愿
[02:18.42]那已成步点的旅程无言
[02:23.79]看东山口变成了潮人街
[02:26.25]倔强地搭起草房子倔强的曹文轩
[02:29.79]没法干涉你都不敢舍弃
[02:32.10]我的东山口像父亲儿时的甘蔗地
[02:34.74]我是贩卖其中回忆贪婪的商人
[02:37.20]我的日记变成账本文字炼化出舍利
[02:40.08]翻找过往翻到道歉信抱歉它回不来
[02:42.81]于是我赌上一切就让它来追赌债
[02:45.09]在无人在乎的时光里我在乎着时光
[02:47.76]城市里捡着过期的记忆我像在拾荒
[02:50.40]怎么还能奔跑和哭泣就觉垂垂老矣
[02:53.10]泼墨的故乡画我不像话地挥挥毛笔
[02:55.77]写不出的阅读题握不住掌机的手柄
[02:58.44]听见童年溘然长逝木棉缓降于头顶
[03:01.11]日月耀眼或皎洁洒向少年与老街
[03:03.87]影子躲着我也躲着那些笑脸与跑鞋
[03:06.51]我被困在这个地方困着困着做个梦
[03:09.18]要做个梦想家当我的梦想家`
  },
  {
    id: 2013750367,
    title: "新生",
    artist: "leomantic",
    cover: "https://p2.music.126.net/qnco-vO6kLkl2l6yp74GFQ==/109951168212021441.jpg",
    lrc: "纯音乐~"
  },
  {
    id: 1905096365,
    title: "嵌在晚霞中的橘",
    artist: "邹牧虞",
    cover: "https://p1.music.126.net/WUUBlyhAFUvFDJ4MJXIx6A==/109951166753692371.jpg",
    lrc: "纯音乐~"
  },
  {
    id: 2141151463,
    title: "泥潭",
    artist: "王子健",
    cover: "https://p2.music.126.net/pJDsdlLiG6eOsv100nbs_g==/109951169458351646.jpg",
    lrc: `[00:02.45]我躺在一片粘稠潮湿的泥土
[00:04.81]在无边无际的绝望里习惯着麻木
[00:08.45]我踩出一个又一个深坑重复
[00:11.07]倒映出天空和我破碎的无助
[00:14.14]
[00:14.60]被神明偏爱的孩子在岸上跳着舞
[00:17.32]而其他人却呆呆地光着脚驻足
[00:20.40]于是让他们陷在泥潭里背上重负
[00:23.33]于是他们也开始“跳舞”
[00:25.71]
[00:25.96]让淤泥
[00:27.07]一点一点漫过我
[00:29.59]都淹没
[00:30.24]一点一点地浸透
[00:32.62]堵塞住
[00:33.32]一遍一遍我的脉搏
[00:35.75]缠住我 绊着我 还有谁能来救我
[00:39.18]
[00:39.53]一天一天荒废过
[00:41.85]逃不脱
[00:42.61]一天一天地陷落
[00:45.19]泥潭蚕食着剩下的我
[00:47.10]将一切全都生吞活剥
[00:50.48]不放过
[00:57.65]
[01:04.06]我躺在一片粘稠潮湿的泥土
[01:06.64]在无边无际的绝望里习惯着麻木
[01:10.22]我踩出一个又一个深坑重复
[01:12.85]倒映出天空和我的孤独
[01:16.03]
[01:16.28]被神明偏爱的孩子在岸上跳着舞
[01:19.32]而其他人却呆呆地光着脚驻足
[01:22.25]于是让他们陷在泥潭里背上重负
[01:25.28]于是他们也开始“跳舞”
[01:27.60]
[01:27.85]让淤泥
[01:29.01]一点一点漫过我
[01:31.44]都淹没
[01:32.15]一点一点地浸透
[01:34.53]堵塞住
[01:35.23]一遍一遍我的脉搏
[01:37.65]缠住我 绊着我 还有谁能来救我
[01:40.98]
[01:41.34]一天一天荒废过
[01:43.81]逃不脱
[01:44.52]一天一天地陷落
[01:47.14]泥潭蚕食着剩下的我
[01:49.11]将一切全都生吞活剥
[01:52.23]不放过
[01:53.60]
[01:53.90]他们说
[01:55.21]曾有雨往下落
[01:57.94]落在脚下汇集成湖泊
[02:06.27]我们会像鱼那样自由
[02:11.12]阳光通透 呼吸轻柔 没有尽头
[02:17.13]可是我
[02:18.95]
[02:19.41]一天一天往下落
[02:21.75]都淹没
[02:22.46]一天一天被浸透
[02:24.87]堵塞住
[02:25.53]一遍一遍我的脉搏
[02:27.96]缠住我 绊着我 还有谁能来救我
[02:31.69]一天一天荒废过
[02:34.11]逃不脱
[02:35.58]一天一天地陷落
[02:37.44]如果你路过
[02:39.11]千万别靠近我`
  },
  {
    id: 1879128089,
    title: "琥珀艾尔（Amber Ale）",
    artist: "灰澈",
    cover: "https://p1.music.126.net/uTDm4og_OErehDU5gh_NQg==/109951166427186614.jpg",
    lrc: "纯音乐~"
  },
  {
    id: 2667716747,
    title: "云海乐章",
    artist: "鸣潮先约电台 / jkinss",
    cover: "https://p1.music.126.net/8-AlS_ljHufHQ_J3LIo9vg==/109951170406599556.jpg",
    lrc: "纯音乐~"
  },
  {
    id: 1912152425,
    title: "等风来",
    artist: "Parion圆周率",
    cover: "https://p2.music.126.net/FNzch14tbbIHwHH4wlcW_A==/109951165411841248.jpg",
    lrc: "纯音乐~"
  },
  {
    id: 2676687608,
    title: "Daisy Crown",
    artist: "Empty old City",
    cover: "https://p2.music.126.net/J0ZfqWmqX3zGJLzTubJ7vg==/109951170498554226.jpg",
    lrc: `[00:01.585] 巡り逢ったあの水辺で 君の背中に見えたのは
[00:12.737] 悲劇が泳いだ紋様 命の瞬きと 仄かに揺れる星の舞
[00:27.012] 君との永遠を願うように 白い花を紡いだよ
[00:38.468] 名前を呼ぶ声に 光と慈愛があった
[00:44.198] 時間が経っても 褪せないような音がしたんだ
[00:49.563] With the daisy crown 眠る愛の音
[00:54.769] 青白い月光 濡れる頬にそっと
[01:01.307] 暖かくて柔らかい 身体中の想いを添えるから
[01:07.507] Now I know by sharing our warmth, we came closer
[01:24.356] 君が祈りを捧ぐたび 僕はそっと影を消したよ
[01:35.556] 鐘が鳴り止むまで 秘密を名乗り続けた
[01:41.526] 君が言うなら形はいっそ求めない
[01:56.618] Purely satisfied only to play with toys together
[02:02.219] Maybe I'm shaped by thousands of memories of you
[02:07.733] 互いに僕らは埃だらけのフィルムを抱えてる
[02:12.831] 日常から少し遠い安息へ
[02:24.723] With the daisy crown 眠る愛の音
[02:29.704] 青白い月光 照らされる少女
[02:36.296] 暖かくて柔らかい 面影は鮮明に咲いているかい
[02:42.573] It lets you know we're sharing our warmth however far
[02:50.332] On the daisy crown 夢を見たの
[02:55.379] 白昼よりずっと暖かい夢を
[03:01.780] 次目を覚ましたら消えそうな あの記憶に身を任せてる
[03:08.327] Now I know we're sharing our warmth however far`
  },
  {
    id: 2667716744,
    title: "故风吟游之地",
    artist: "鸣潮先约电台",
    cover: "https://p1.music.126.net/8-AlS_ljHufHQ_J3LIo9vg==/109951170406599556.jpg",
    lrc: "纯音乐~"
  },
  {
    id: 2722447989,
    title: "致以无名的抗争者",
    artist: "鸣潮先约电台",
    cover: "https://p2.music.126.net/ThQj6h7-ZtSoeRRESBYa_A==/109951171402488996.jpg",
    lrc: `[00:03.585]乐器独奏 Instrument Solo：
[00:04.585]Acoustic Guitar / Electric Guitar：愤怒的糖
[00:05.585]Bass：Toshino Tanabe
[00:06.585]Drum：藤崎誠人
[00:10.085]助理 Assistant：markmilian / A19
[00:10.585]谱务 Scoring：markmilian / A19 / 吴瀚洋
[00:11.585]Was it real
[00:13.252]Was it mine
[00:14.775]Was it worth it
[00:18.123]Sometimes I feel
[00:19.837]like a player
[00:21.521]that struts and frets by the scripts
[00:24.752]All i know is
[00:26.427]my desire
[00:27.725]and my love won't fade
[00:30.428]I'll set a fire
[00:33.225]burn fears to ashes
[00:38.115]put some petals on my chest
[00:41.100]right on the tear
[00:44.436]I will just fall into that
[00:47.389]sunset on the rusty sea
[00:51.502]I'm a vessel, done its best
[00:53.970]to contain their schemes
[00:56.658]now all sounds are drowning with me
[01:02.614]Through those rainbows, shadows
[01:05.374]struggles, muddles
[01:06.935]clearly I saw
[01:08.699]my way to the destiny
[01:12.122]There is something no one can take from me
[01:16.503]On my laurel, my sword
[01:18.560]my battles and
[01:19.937]corals, sea foam
[01:21.995]I have left my fingerprints
[01:24.776]Pain slipped away in a heartbeat
[01:29.412]I think I've finally found my peace
[01:57.008]All the medals on my chest
[01:59.927]are glimmering
[02:03.432]A flash of light burns my eyes
[02:06.266]making me ponder again
[02:10.064]I burn the clouds
[02:11.545]with all the fuel in my veins
[02:15.197]But somehow
[02:18.529]I linger in doubts
[02:21.622]Through those rainbows, shadows
[02:24.282]struggles, muddles
[02:25.848]clearly I saw
[02:27.842]my way to the destiny
[02:31.131]There is something no one can take from me
[02:35.445]All the bruises
[02:36.635]are the clues
[02:38.104]that lead me to
[02:39.390]solution to my doubts and deepest fears
[02:44.594]Glory's not all about winning
[02:48.585]but blazing till the last minute
[03:10.513]Through those rainbows, shadows
[03:13.636]struggles, muddles
[03:15.173]clearly I saw
[03:16.935]my way to the destiny
[03:20.155]There is something no one can take from me
[03:24.733]All the bruises
[03:26.015]are the clues
[03:27.744]that lead me to
[03:28.821]solution to my doubts and deepest fears
[03:34.052]Glory's not all about winning
[03:37.867]but blazing till the last minute`
  },
  {
    id: 2111042517,
    title: "一日还",
    artist: "此间不语",
    cover: "https://p2.music.126.net/0acW73oztapT-SZl0RdSbg==/109951169200781159.jpg",
    lrc: `[00:00.16]“他关上窗，熄了灯，准备秣马厉兵去做一个梦。”
[00:01.16]——题记
[00:01.41]合：
[00:01.68]多情是我
[00:03.69]青山绿野银鞍白马金骏眉
[00:06.95]谁够我将满心草色枉费
[00:11.21]只此一程
[00:12.98]天真颠沛流燕飞鱼骑一尾
[00:16.74]夕阳再快也追不上我的马背
[00:21.00]李蚊香：
[00:22.00]衣襟别座金陵城
[00:23.76]如此信步环腰带潮声
[00:26.52]吹灯时忧灯痒
[00:28.53]踩雪时竟怕雪疼
[00:31.29]云雀：
[00:31.79]怀梦来去杏花村
[00:33.29]也能恃勇招摇南天门
[00:35.55]见过疾雷也只如
[00:38.31]天公的娇嗔
[00:40.81]李蚊香：
[00:41.06]蒹葭爱自照临水
[00:43.57]关雎厌倦飞，
[00:45.57]云雀：
[00:46.07]坦诚糊涂谓我
[00:48.20]明白清醒谓谁
[00:52.20]合：
[00:52.45]多情是我
[00:53.71]青山绿野银鞍白马金骏眉
[00:57.22]谁够我将满心草色枉费
[01:01.73]只此一程
[01:03.23]天真颠沛流燕飞鱼骑一尾
[01:07.24]夕阳再快也追不上我的马背
[01:20.41]云雀：
[01:21.41]随意大寒恋小暑
[01:23.66]永远清溪泥塘也赤足
[01:26.67]偷明月换蜡烛
[01:28.68]趁夜色无人看护
[01:30.93]李蚊香：
[01:31.69]穿林还需搭鸥鹭
[01:33.19]从速 人有私心山有雾
[01:35.95]且将青天赠猛虎
[01:38.71]鞭赏赐白鹭
[01:40.72]云雀：
[01:41.22]得来葡萄酒美
[01:43.22]便失去夜光杯
[01:45.48]李蚊香：
[01:45.98]失一挚得一贵
[01:47.99]情之外理之内
[01:52.00]合：
[01:52.50]多情是我
[01:53.76]青山绿野银鞍白马金骏眉
[01:57.27]谁够我将满心草色枉费
[02:01.78]只此一程
[02:03.54]天真颠沛流燕飞鱼骑一尾
[02:07.05]夕阳再快也追不上我的马背
[02:11.06]李蚊香：
[02:11.32]安坐汹涌浪花蕊
[02:13.82]雁群见我排长队
[02:16.08]天的蓝海的蔚
[02:18.34]一身鱼刺 焉有软肋
[02:22.85]云雀：
[02:23.61]无情亦我
[02:25.15]竹雨松风 面壁一剪梅
[02:28.41]是花就 绝不向春天谄媚
[02:32.88]李蚊香：
[02:33.02]周游山海
[02:34.73]最爱此身天地过境的芳菲
[02:37.99]合：
[02:38.34]一生绝非只有一场情天恨水
[02:43.00]——————————
[02:48.31]题字：越千糖
[02:50.76]PV：缄玫`
  }
];